benchmarks/artillery-socketio.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 30
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 30
      name: "Sustained load phase"
  engines:
    socketio: {}
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: "HTTP Endpoints"
    weight: 3
    flow:
      # Test the REST API endpoints
      - post:
          url: "/add"
          json:
            key: "vendor1"
            value: |
              [
                {"type": "SJC", "buyPrice": 7320000, "sellPrice": 7380000},
                {"type": "999.9", "buyPrice": 7240000, "sellPrice": 7290000}
              ]
      - get:
          url: "/get/vendor1"
          expect:
            - statusCode: 200
      - get:
          url: "/vendors"
      - think: 1

  - name: "Socket.IO Connection"
    weight: 7
    engine: "socketio"
    flow:
      # Connect and join a room
      - emit:
          channel: "join"
          data: "vendor1"
      
      # Wait for price updates
      - think: 5
      
      # Verify connection works by listening for events
      - on:
          channel: "priceUpdate"  
      
      # Stay connected for a while
      - think: 10