benchmarks/socketio-test.yml
# socketio-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
  engines:
    socketio-v4: {}

scenarios:
  - engine: socketio-v4
    name: "Subscribe to price updates"
    flow:
      - connect:
          query:
            EIO: "4"
            transport: "websocket"
      - emit:
          channel: "join"
          data: "pnj"
      - think: 5
      - loop:
          - think: 1
          - emit:
              channel: "ping"
              data: ""
        count: 10